In [3]:
import pandas as pd
df_data = pd.read_csv("supermarket_sales.csv")
import numpy as np

In [54]:
#colunas são chamadas de series no panda 
labels = ['a','b','c']

minha_lista = [10,20,30]

arrey_lista = np.array([10,20,30]) #criando um array list utilizando a biblioteca numpy

d = {'a':10, 'b':20, 'c':30} #criando um dicionário de atributos com 2 "objetos" junto em cada tupla

In [55]:
# criando uma lista com o panda, e atribuido automaticamente indices para essa lista 0,1,2
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [6]:
#criando a mesma lista acima porém modificando o indice criado automaticamente
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [7]:
#criando uma lista agora com o dicionario D que já possui 2 objetos juntos
# o panda já identificou as letras como indice e os numeros como os elementos da lista
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [18]:
#crinado uma nova serie tudo junto em uma linha
serie1 = pd.Series(data=[1,2,3,4], index=['EUA', 'Alemanha', 'Russia', 'Japao'])

In [19]:
serie1

EUA         1
Alemanha    2
Russia      3
Japao       4
dtype: int64

In [20]:
#crinado uma nova serie tudo junto em uma linha
serie2 = pd.Series(data=[1,2,5,4], index= ['EUA', 'Alemanha', 'Italia', 'Japao'])

In [21]:
serie2

EUA         1
Alemanha    2
Italia      5
Japao       4
dtype: int64

In [24]:
serie1['Alemanha'] #pegando a informação do index da Serie para ser exibido
serie1[['Alemanha', 'Russia', 'EUA']] #pegando várias informações de uma vez da Serie para exibir

Alemanha    2
Russia      3
EUA         1
dtype: int64

# Criando e trabalhando com DataFrames

In [25]:
#realizando a importancia da numpy biblioteca com funções para trabalhar com matematica, criação de vetores etc
# importando junto uma função randn de random para gerar numeros aleatórios
from numpy.random import randn

In [28]:
#criando um data frame abaixo nada mais que um tabela com colunas e linhas, e dados aleatórios usando a randn
# Index referen-se as linhas da tabela(data frame) e columns o nome das colunas da tabela 
df = pd.DataFrame(randn(5,4), index=['A','B','C','D','E'], columns="W X Y Z".split())
df

          W         X         Y         Z
A  1.397840  0.836632  0.680858  1.131313
B  0.526963  2.281291  0.165073  0.752418
C -0.269319 -1.789297  2.261069  1.758681
D -1.351637  1.725159  1.191414  0.119577
E -0.621136  0.393121  1.445768  0.107923

In [32]:
#trabalhando na seleção de dados dentro do data frame (tabela) criada
#pedindo para o python mostrar o conteudo da coluna W e X juntas
df[['W','X']]

          W         X
A  1.397840  0.836632
B  0.526963  2.281291
C -0.269319 -1.789297
D -1.351637  1.725159
E -0.621136  0.393121

In [37]:
#abaixo é criado uma nova coluna no data frame que não existe(new), e que recebe os mesmos valores da coluna W
# df['new'] = df['W']
#nas linhas abaixo é criado a coluna new, porém seus valores será o resultado da soma da coluna W e Z
df['new'] = df['W'] + df['Z']
df

          W         X         Y         Z       new
A  1.397840  0.836632  0.680858  1.131313  2.529154
B  0.526963  2.281291  0.165073  0.752418  1.279381
C -0.269319 -1.789297  2.261069  1.758681  1.489362
D -1.351637  1.725159  1.191414  0.119577 -1.232060
E -0.621136  0.393121  1.445768  0.107923 -0.513212

In [41]:
#EXEMPLO de como deletar colunas usando a função drop para tirar linha ou colunas(labels)
# porém somente com a linha df.drop('new', axis=1) ele não retira do data frame real, é só o resultado da operação de drop
df.drop('new', axis=1)

          W         X         Y         Z
A  1.397840  0.836632  0.680858  1.131313
B  0.526963  2.281291  0.165073  0.752418
C -0.269319 -1.789297  2.261069  1.758681
D -1.351637  1.725159  1.191414  0.119577
E -0.621136  0.393121  1.445768  0.107923

In [42]:
#abaixo é realizado uma operação de drop em uma coluna e dando um "commit" no data frame oficial, retirando a
#coluna indicada no operação
df.drop('new', axis=1, inplace= True)

In [47]:
#abaixo é mostrado como realizar seleção de dados de linhas do data frame com a função loc
# pegando de uma unica linha: df.loc[['A']]
df.loc[['A', 'C']]

          W         X         Y         Z
A  1.397840  0.836632  0.680858  1.131313
C -0.269319 -1.789297  2.261069  1.758681

In [53]:
#como pegar e mostrar um dado especifico de uma posição exata da tabela em relação coluna e linha usando a iloc
# linha x coluna (iniciando em 0,0)
df.iloc[0,1]

0.8366322236922847

# Exercicio para criar um data frame com numeros random

In [13]:
import pandas as pd
from numpy.random import randn

In [14]:
#criando um data frame novo chamado table com numeros aleatórios
table = pd.DataFrame(randn(4,4), index=['line1','line2','line3','line4'], columns='a b c d'.split())
table

              a         b         c         d
line1  0.578241 -0.628637 -0.605211 -0.545571
line2  0.635224  0.207401  1.521347 -0.868123
line3  0.120046 -0.518488 -2.402871 -0.721911
line4  0.116678  1.812335  0.938991  0.911632

In [15]:
#mostre os dados das colunas a, b e d
table[['a','b','d']]

              a         b         d
line1  0.578241 -0.628637 -0.545571
line2  0.635224  0.207401 -0.868123
line3  0.120046 -0.518488 -0.721911
line4  0.116678  1.812335  0.911632

In [16]:
#mostre somente os dados da linha 3
table.loc[['line3']]

              a         b         c         d
line3  0.120046 -0.518488 -2.402871 -0.721911

In [18]:
#mostrar somente o elemento(dado) que está na linha 4 coluna b
#table.iloc[3,1]
table.iloc[1,3]

-0.8681227279161033

In [19]:
#adicionar uma nova coluna E que será o resultado da multiplicação de A e C 
table['E'] = table['a'] * table['c']
table

              a         b         c         d         E
line1  0.578241 -0.628637 -0.605211 -0.545571 -0.349958
line2  0.635224  0.207401  1.521347 -0.868123  0.966396
line3  0.120046 -0.518488 -2.402871 -0.721911 -0.288456
line4  0.116678  1.812335  0.938991  0.911632  0.109559

In [27]:
#exibindo as colunas A, B e D do data frame
#table[['a','b','d']]

# pedindo para exibir as linhas(indices) line1 e line3 com a função loc
#table.loc[['line1', 'line3']]

#Exemplo para retornar conjunto de valores especificos com a loc, em relação as linhas(indices) e colunas(series)
table.loc[['line1','line4'], ['a','b']]

              a         b
line1  0.578241 -0.628637
line4  0.116678  1.812335

In [48]:
#Como pegar todos os valores por exemplo de quase todas as linhas, somente a última linha que não, e colunas especificas
# os : significa tudo e -1 é tirando a última coluna, e no segundo parametro os : significa selecionar todas as colunas
table.iloc[:-1, :2] #aqui é retornado os valores somente das 3 primeiras linhas das 2 primeiras colunas

              a         b
line1  0.578241 -0.628637
line2  0.635224  0.207401
line3  0.120046 -0.518488

In [61]:
table.iloc[:-2, :3] #retornando somente as 2 primeiras linhas(index) e 3 colunas(series)

              a         b         c
line1  0.578241 -0.628637 -0.605211
line2  0.635224  0.207401  1.521347

In [140]:
#selecionando "fatias" de dados dentro do dataframe excluindo colunas e linhas da seleção

#mostrando os valores somente começando da linha 2 e parando na 3 e mostrando somente C e D
table.iloc[1:-1, 2:-1]

              c         d
line2  1.521347 -0.868123
line3 -2.402871 -0.721911

In [81]:
table.loc[['line1', 'line3'], ['a','d']]

              a         d
line1  0.578241 -0.545571
line3  0.120046 -0.721911

In [86]:
table

              a         b         c         d         E
line1  0.578241 -0.628637 -0.605211 -0.545571 -0.349958
line2  0.635224  0.207401  1.521347 -0.868123  0.966396
line3  0.120046 -0.518488 -2.402871 -0.721911 -0.288456
line4  0.116678  1.812335  0.938991  0.911632  0.109559

In [85]:
table.iloc[1:3,1:-1] #selecionando um bloco central de valores dentro do data frame, 2 parametro é referente as colunas

              b         c         d
line2  0.207401  1.521347 -0.868123
line3 -0.518488 -2.402871 -0.721911

# Trabalhando com seleção condicional nos data frame

In [95]:
#Exemplo de retorno de valores que são maiores que 0 ou outro numero dentro do data frame
#table[table > 0]

table[table > 1]

        a         b         c   d   E
line1 NaN       NaN       NaN NaN NaN
line2 NaN       NaN  1.521347 NaN NaN
line3 NaN       NaN       NaN NaN NaN
line4 NaN  1.812335       NaN NaN NaN

In [106]:
#pegando uma parte dos dados no meio da tabela com o iloc e verificando quais posições são maiores que 1
table.iloc[1:3, 1:-1] > 1

           b      c      d
line2  False   True  False
line3  False  False  False

In [115]:
#Exemp. p/ mostrar somente os valores que são maiores que 0 na coluna C, excluindo as outras linhas(indices) e colunas
#table[table['c'] > 0]

#Mostrando somente os valores da coluna B que são maiores que 1
table[table['b'] > 1]

              a         b         c         d         E
line4  0.116678  1.812335  0.938991  0.911632  0.109559

# Funções extras para indices (linhas)

In [147]:
# as duas linhas abaixo servem para consultar o nome das colunas e dos indices do data frame
table.columns
table.index

#Ex de como alterar os nomes dos indices(linhas) do data frame usando o inplace para alterar no original
table.reset_index(inplace=True)

In [151]:
#Ex de como voltar uma alteração de indices retornando a coluna nova criada como indice do data frame
table.set_index('index', inplace=True)

In [159]:
#Exemplo de como editar o nome dos indices com base a uma lista criada separada em python

novo_indice = 'SP MG GO RO'.split() #criei uma lista em python contendo o titulo dos novos indices e já os separando com o split

# agora é preciso passar o novo indice para tornar uma coluna no meu data frame e depois joga-lo como novo indice
table['new_index'] = novo_indice

#passando a nova coluna new_index para ser o nome dos indices do data frame
table.set_index("new_index", inplace=True)

In [161]:
table

                  a         b         c         d         E
new_index
SP         0.578241 -0.628637 -0.605211 -0.545571 -0.349958
MG         0.635224  0.207401  1.521347 -0.868123  0.966396
GO         0.120046 -0.518488 -2.402871 -0.721911 -0.288456
RO         0.116678  1.812335  0.938991  0.911632  0.109559

# Exemplo de prática com data frame

In [1]:
import pandas as pd
from numpy.random import randn

In [2]:
df = pd.DataFrame(randn(6,6), index=['A', 'B', 'C', 'D', 'E', 'F'], columns='num1 num2 num3 num4 num5 num6'.split())

In [3]:
df

       num1      num2      num3      num4      num5      num6
A  0.601718  0.892456  0.273334 -1.319149  0.366694 -1.484359
B -0.815722  0.708354  1.056458  1.575795  1.552516 -0.973878
C -1.297998 -1.299719  0.544698  1.168898 -0.010883  0.988949
D  1.223095 -0.333368  0.610787 -1.447547  1.380218 -0.516949
E  0.464213  1.322799 -1.330940  1.733445 -2.927636  1.989029
F -1.182261  0.126514 -2.006184  0.171739 -0.742565 -1.005602

In [4]:
df[['num1', 'num2']]

       num1      num2
A  0.601718  0.892456
B -0.815722  0.708354
C -1.297998 -1.299719
D  1.223095 -0.333368
E  0.464213  1.322799
F -1.182261  0.126514

In [5]:
df.loc[['A','E']]

       num1      num2      num3      num4      num5      num6
A  0.601718  0.892456  0.273334 -1.319149  0.366694 -1.484359
E  0.464213  1.322799 -1.330940  1.733445 -2.927636  1.989029

In [11]:
df['Total'] = df["num1"]+df["num2"]+df["num3"]+df["num4"]+df["num5"]+df["num6"]
df

       num1      num2      num3      num4      num5      num6     Total
A  0.601718  0.892456  0.273334 -1.319149  0.366694 -1.484359 -0.669305
B -0.815722  0.708354  1.056458  1.575795  1.552516 -0.973878  3.103521
C -1.297998 -1.299719  0.544698  1.168898 -0.010883  0.988949  0.093944
D  1.223095 -0.333368  0.610787 -1.447547  1.380218 -0.516949  0.916237
E  0.464213  1.322799 -1.330940  1.733445 -2.927636  1.989029  1.250910
F -1.182261  0.126514 -2.006184  0.171739 -0.742565 -1.005602 -4.638359

In [118]:
df.iloc[3:-1, 3:-1]

       num4      num5      num6
D -1.447547  1.380218 -0.516949
E  1.733445 -2.927636  1.989029

In [129]:
df.iloc[ 4: , 1:-4]

       num2      num3
E  1.322799 -1.330940
F  0.126514 -2.006184

In [134]:
df[df['num4'] > 1]

df[df['Total'] > 1.5]

       num1      num2      num3      num4      num5      num6     Total
B -0.815722  0.708354  1.056458  1.575795  1.552516 -0.973878  3.103521

In [162]:
#Criando uma seleção condicional dupla entre 2 colunas, verificando uma condição nas duas juntas com & 
#onde o dado só será selecionado o indice(linha) se satisfazer a condição nas 2 colunas
df[ (df['num4'] > 0.6) & (df['num2'] > 0.7) ]

       num1      num2      num3      num4      num5      num6     Total
B -0.815722  0.708354  1.056458  1.575795  1.552516 -0.973878  3.103521
E  0.464213  1.322799 -1.330940  1.733445 -2.927636  1.989029  1.250910

In [139]:
df[ (df['num2'] > 1) & ( df['num4'] > 1) ]

       num1      num2     num3      num4      num5      num6    Total
E  0.464213  1.322799 -1.33094  1.733445 -2.927636  1.989029  1.25091